package com.example.family.erotimatologio;

/**
 * Created by Family on 24/8/2017.
 */

public class QuestionLibraryPeninta {

    private String mQuestions[] = {
            "Ποιος ο αριθμός των εδαφικών τροχών του άρματος;","Με τι λάδι λιπαίνονται οι ακραίες μεταδόσεις (εως – 20οC);","Με τι λάδι λιπαίνεται το κιβώτιο ταχυτήτων;",
            "Πόσους συσσωρευτές έχει το άρμα;", "Τι λάδι παίρνει το κυβερνητικό κύκλωμα πεδήσεως;", "Ποια η ισχύς του κινητήρα του άρματος;", "Πως καθαρίζουμε τα φίλτρα αέρος;", "Σε ποια θερμοκρασία συμπληρώνουμε ψυκτικό υγρό;", "Ποια η κανονική θερμοκρασία λειτουργίας του άρματος;", "Τι είναι το περισκόπιο ΕΜΕS 18;", "Τι από τα παρακάτω είναι ανάμεσα στις δυνατότητες του βλητικού υπολογιστή;", "Τι είναι το πανοραμικό περισκόπιο ΤRΡ 5 Α;", "Τι είναι η τηλεσκοπική διόπτρα ΤΖF 3Α;",
            "Ποιες πρέπει να είναι οι αποστάσεις μεταξύ των αρμάτων;","Ποιες οι προϋποθέσεις μιας θέσης μάχης;","Ποιο το βεληνεκές μάχης του βλήματος ΗΕΑΤ;","Ποιο το βεληνεκές μάχης του βλήματος ΑΡFSDS;","Ποιο σημείο του στόχου επιλέγεται ως σημείο σκόπευσης;","Ποιο βλήμα ανήκει στην κατηγορία των βλημάτων υψηλής  κινητικής ενέργειας;","Ποιο από τα παρακάτω δεν ανήκει στα μέτρα αποφυγής προσβολής από Α/Φ;","Ποιος ο σκοπός του συστήματος στεγανοποιήσεως;","Μέχρι ποια πίεση πρέπει να φτάσει το μανόμετρο του συστήματος στεγανοποιήσεως;","Τι πρέπει να προσέξουμε όταν ενεργοποιήσουμε το σύστημα στεγανοποιήσεως;",
            "Ποια ταχύτητα τοποθετεί μηχανικά ο μοχλός ταχυτήτων σε περίπτωση ανάγκης;","Πως ρυθμίζονται οι κινήσεις του άρματος;","Στο βεληνεκές μάχης το μέγιστο βέλος της τροχιάς δεν πρέπει να:","Η φράση ΒΑΛΛΩ ΤΩΡA από ποιόν αναφωνείτε;","Ποιο σημείο επιλέγεται ως σημείο του σκοπευτικού διαφράγματος για το πρώτο βλήμα;","Πότε δεν χρησιμοποιούμε την δυναμική εκτροπή;","Ποιοι παράγοντες επηρεάζουν την χρήση καπνού;","Πόσοι είναι οι κανόνες της τηλεμέτρησης;","Για την σκόπευση με την ΤΖF 3 Α ποια κλίμακα αποστάσεων χρησιμοποιούμε για βολή με το πολυβόλο;","Πότε ένας στόχος χαρακτηρίζεται άκρως επικίνδυνος;",
            "Τι ένταση πρέπει να έχουν τα εσωτερικά φώτα του άρματος κατά την νύχτα;","Μέχρι ποια απόσταση μπορεί το άρμα να εκτελέσει βολή ακριβείας;","Ποιος ο σκοπός του βλήματος λευκού φωσφόρου;","Τι χρώμα σημαίας χρησιμοποιεί το άρμα όταν κάνει βολή;","Τι χωρητικότητα έχει ο κάθε συσσωρευτής του άρματος;","Ποιος ο σκοπός του θερμαντήρα;","Σε ποια θέση πρέπει να βρίσκεται ο μοχλός κατευθύνσεως για να τεθεί σε λειτουργία ο κινητήρας του άρματος;","Τι κλειδί χρησιμοποιούμε για τον καθαρισμό του φίλτρου λαδιού;","Που πρέπει να είναι το σημείο κοπής όταν κόβουμε την ερπύστρια;","Που πρέπει να είναι το σημείο σύνδεσης όταν δένουμε την ερπύστρια;",
            "Όταν κάνουμε έλεγχο τάσης ερπύστριας:","Τι από τα παρακάτω αναγράφεται στην διαταγή λιπάνσεως;","Τι είναι ο διατρητικός πυρήνας;","Ποιο στοιχείο αναγράφεται στο κυτίο πυρομαχικών;","Ποια από τις παρακάτω θέσεις αποφεύγουμε πιο πολύ;","Σε ποιο σημείο γίνεται η σκόπευση του στόχου όταν χρησιμοποιούμε δυναμική εκτροπή;","Ποια εκτροπή χρησιμοποιείται για βλήμα ΗΕΑΤ όταν δεν δουλεύει η δυναμική εκτροπή;"
    };

    private String mChoices [][] = {{"8 Ζεύγη ανά πλευρά","5 Ζεύγη ανά πλευρά","7 Ζεύγη ανά πλευρά"},
            {"SAE 75", "SAE 90", "SAE 50"},
            {"SAE 30W ", "SAE 10W", "SAE 20W"},
            {"4","6","8"},
            {"SAE 5W ","SAE 10W","SAE 30W"},
            {"800ΗΡ/2000 Σ. Α. Λ.","830ΗΡ/2200 Σ. Α. Λ.","880ΗΡ/2500 Σ. Α. Λ."},
            {"Με πίεση αέρος μικρότερη των 5 bar.","Με πίεση αέρος 6 bar.","Με πίεση αέρος 7 bar."},
            {"85OC","Μικρότερη των 85OC","90OC"},
            {"100-120οC","94-100οC","75-93οC"},
            {"Κύριο όργανο σκόπευσης του πυροβολητή.", "Κύριο όργανο σκόπευσης του αρχηγού.", "Κύριο όργανο σκόπευσης αρχηγού – πυροβολητή."},
            {"Θερμοκρασία αέρα", "Θερμοκρασία προωθητικού γεμίσματος των βλημάτων", "Όλα τα παραπάνω."},
            {"Περισκόπιο του πυροβολητή.","Περισκόπιο του γεμιστή.","Περισκόπιο του αρχηγού"},
            {"Κύριο όργανο σκόπευσης του πυροβολητή.","Βοηθητικό όργανο σκόπευσης του πυροβολητή.","Κύριο όργανο σκόπευσης του αρχηγού."},
            {"20-40μ.", "40-60μ.", "50-100μ."},
            {"Κάλυψη και Απόκρυψη", "Παρατήρηση", "Όλα τα παραπάνω"},
            {"800μ.","900μ.","1000μ"},
            {"1000μ.","1100μ.","1200μ."},
            {"Το κέντρο του στόχου","Ο πόδας του στόχου","Η κορυφή του στόχου"},
            {"HEAT","ΗΕΡ","APFSDS "},
            {"Συσπείρωση αρμάτων","Διασπορά αρμάτων","Κάλυψη και απόκρυψη"},
            {"Στεγανοποίηση από τα νερά της βροχής","Στεγανοποίηση από υδάτινο κώλυμα μικρότερο από 1 μ.","Στεγανοποίηση από υδάτινο κώλυμα μεγαλύτερο από 1 μ."},
            {"60 ΒΑR","70 ΒΑR ","80 ΒΑR"},
            {"Να είναι ανοιχτή η θυρίδα του οδηγού", "Να είναι ανοιχτή η θυρίδα του αρχηγού", "Να είναι ανοιχτή η θυρίδα του γεμιστή"},
            {"Την 1η","Την 2η","Την όπισθεν"},
            {"Με την πρωτοβουλία του οδηγού","Με παραγγέλματα του αρχηγού προς τον οδηγό","Με παραγγέλματα του οδηγού προς τον αρχηγό"},
            {"Είναι ίσο  με το μέσο ύψος του στόχου","Ξεπερνά το μέσο ύψος του στόχου","Είναι μικρότερο από το μέσο ύψος του στόχου "},
            {"Αρχηγό","Πυροβολητή","Από οποιονδήποτε πυροδοτεί"},
            {"Το πάνω μέρος του νηματόσταυρου","Το κέντρο του νηματόσταυρου","Το κάτω μέρος του νηματόσταυρου"},
            {"Όταν στόχος και άρμα κινούνται","Όταν κινείται το άρμα κι ο στόχος είναι σταθερός","Όταν στόχος και άρμα είναι ακίνητα"},
            {"Εχθρική τοποθεσία", "Κατεύθυνση και ταχύτητα ανέμου", "Όλα τα παραπάνω"},
            {"2","3","4"},
            {"ΗΕΡ","ΗΕSΗ","ΜG"},
            {"Όταν έχει δυνατότητα καταστροφής και ετοιμάζεται για την προσβολή του άρματος μας.","Όταν έχει δυνατότητα καταστροφής αλλά δεν ετοιμάζεται για την προσβολή του άρματος μας.","Όταν δεν έχει την δυνατότητα καταστροφής του άρματος μας."},
            {"Δυνατή","Να είναι σβηστά","Την χαμηλότερη επιτρεπτή για την εκτέλεση των καθηκόντων του πληρώματος."},
            {"4.700 μέτρα","4.000 μέτρα","4.500 μέτρα"},
            {"Καταστροφή αρμάτων","Κατάδειξη στόχων","Καταστροφή κτηρίων"},
            {"Πράσινη","Κόκκινη","Κίτρινη"},
            {"12Χ50Αh","12Χ55 Αh","12Χ100Αh"},
            {"Προθέρμανση ψυκτικού υγρού και συσσωρευτών", "Θέρμανση διαμερίσματος μάχης και οδηγού", "Όλα τα παραπάνω"},
            {"Στην θέση R","Στην θέση 1","Στην θέση Ν"},
            {"Γερμανικό","Πολύγωνο","Σχήματος  Τ"},
            {"Στο εμπρός μέρος του ρυθμιστικού τροχού","Στο πάνω μέρος του ρυθμιστικού τροχού","Στο πίσω μέρος του κινητήριου τροχού"},
            {"Μεταξύ ρυθμιστικού τροχού και 1ου εδαφικού","Μεταξύ ρυθμιστικού τροχού και 1ου υποστηρίξεως","Μεταξύ ρυθμιστικού τροχού και 2ου υποστηρίξεως"},
            {"Δένουμε τα χειρόφρενα","Δεν δένουμε τα χειρόφρενα","Πατάμε φρένο"},
            {"Είδος λιπαντικού","Χρονικό διάστημα λίπανσης","Όλα τα παραπάνω"},
            {"Μέρος των βλημάτων κινητικής ενέργεια", "Μέρος των βλημάτων κινητικής ενέργεια", "Μέρος των βλημάτων κινητικής ενέργεια"},
            {"Αριθμός ονομαστικού","Έτος συσκευασίας","Ημερομηνία λήξεως"},
            {"Θέση κάλυψης πύργου","Θέση κάλυψης σκάφους","Ακάλυπτη θέση βολής"},
            {"Στο κέντρο του στόχου","Στο εμπρόσθιο μέρος του στόχου","Πιο μπροστά από τον στόχο ανάλογα τον τύπο και την ταχύτητα του"},
            {"Μία εκτροπή (5 ΧΠ)","Μισή εκτροπή (2,5 ΧΠ)","Μιάμιση εκτροπή (7,5 ΧΠ)"}
    };

    private String mCorrectAnswers[] = {"7 Ζεύγη ανά πλευρά", "SAE 90", "SAE 10W", "8", "SAE 10W",
            "830ΗΡ/2200 Σ. Λ.","Με πίεση αέρος μικρότερη των 5 bar.","Μικρότερη των 85OC","75-93οC","Κύριο όργανο σκόπευσης αρχηγού – πυροβολητή.",
            "Όλα τα παραπάνω.","Περισκόπιο του αρχηγού","Βοηθητικό όργανο σκόπευσης του πυροβολητή.","50-100μ.","Όλα τα παραπάνω",
            "900μ.","1200μ.","Το κέντρο του στόχου","APFSDS ","Συσπείρωση αρμάτων",
            "Στεγανοποίηση από υδάτινο κώλυμα μεγαλύτερο από 1 μ.","60 ΒΑR","Να είναι ανοιχτή η θυρίδα του αρχηγού","Την 2η","Με παραγγέλματα του αρχηγού προς τον οδηγό",
            "Ξεπερνά το μέσο ύψος του στόχου","Από οποιονδήποτε πυροδοτεί","Το κέντρο του νηματόσταυρου","Όταν στόχος και άρμα είναι ακίνητα","Όλα τα παραπάνω",
            "3","ΜG","Όταν έχει δυνατότητα καταστροφής και ετοιμάζεται για την προσβολή του άρματος μας.","Την χαμηλότερη επιτρεπτή για την εκτέλεση των καθηκόντων του πληρώματος.","4.000 μέτρα",
            "Κατάδειξη στόχων","Κόκκινη","12Χ100Αh","Όλα τα παραπάνω","Στην θέση Ν",
            "Σχήματος  Τ","Στο εμπρός μέρος του ρυθμιστικού τροχού","Μεταξύ ρυθμιστικού τροχού και 1ου εδαφικού","Δεν δένουμε τα χειρόφρενα","Όλα τα παραπάνω",
            "Μέρος των βλημάτων κινητικής ενέργεια","Αριθμός ονομαστικού","Ακάλυπτη θέση βολής","Στο κέντρο του στόχου","Μία εκτροπή (5 ΧΠ)"};

    public String getQuestion(int a){
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a){
        String choice0 = mChoices[a][0];
        return choice0;
    }

    public String getChoice2(int a){
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a){
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }

    public int getLength(){
        int totalQuestions = mCorrectAnswers.length;
        return totalQuestions;
    }
}
