package com.example.family.erotimatologio;

/**
 * Created by Family on 24/8/2017.
 */

public class QuestionLibrary {

    private String mQuestions[] = {
            "Οι τυποποιημένες τεχνικές μάχης διδάσκουν στα πληρώματα του ΟΥΜΑ",
            "Ο ΠΑΠ συμμετέχει στα παρακάτω δίκτυα ασυρμάτου",
            "Τα έμμεσα πυρά στο επίπεδο του Ουλαμού-Ίλης σχεδιάζονται",
            "Τα είδη πυρών του ουλαμού είνα",
            "Οι τεχνικές εκτελέσεως πυρών από ένα ουλαμό αρμάτων είναι",
            "Οι μέθοδοι αλμάτων είναι",
            "Οι βασικοί σχηματισμοί του Ουλαμού είναι ",
            "Ο σχηµατισµός βέλους έχει μεταξύ άλλων τα ακόλουθα χαρακτηριστικά, πλεονεκτήµατα και περιορισµούς",
            "Ο σχηµατισµός κλιµακηδόν",
            "Τι απο τα παρακάτω δεν περιλαμβάνει η αναφορά επαφής του Ουλαμαγού",
            "Οταν ο Ουλαµός βρεθεί αντιµέτωπος µε ένα κώλυµα, πρέπει πρώτα να προσπαθήσει",
            "Η αναφορά επαφής του Ουλαμαγού περιλαμβάνε",
            "Για την καθήλωση των αντιαρµατικών όπλων,  τα πλέον κατάλληλα είναι",
            "Για να ολοκληρωθεί επιτυχώς μια γρήγορη αλλαγή σχηματισμού, κάθε άρμα θα πρέπει να γνωρίζει τα παρακάτω",
            "Η προέλαση είναι μια επιθετική επιχείρηση που αποσκοπεί στην",
            "Θεωρείται ότι λαµβάνουμε επαφή όταν",
            "Κατά τις επιθετικές επιχειρήσεις, οι παράγοντες που διέπουν την κίνηση του ουλαμού από μια θέση στην επόμενη είναι",
            "Η …………….  αποτελείται από ενέργειες που εκτελούνται για την εξασφάλιση του ΑΝΣΚ και την άμυνα απέναντι σε μια εχθρική αντεπίθεση ",
            "Μερικές από τις αρχές τις οποίες ο Ουλαμαγός θα πρέπει να έχει υπ όψιν του κατά την εφαρμογή των κανόνων επίθεσης είναι και οι εξής",
            "Ως μέρος της ίλης ο ΟΥΜΑ μπορεί  κατά τις επιθετικές επιχειρήσεις να εκτελέσει"
    };

    private String mChoices [][] = {
            {"Πώς να καλύπτονται σε περίπτωση προσβολής τους στο χώρο διασποράς", "Την αυτόματη αντίδραση σε καταστάσεις μάχης", "Μεθόδους επικοινωνίας"},
            {"Δίκτυο Ίλης – Δίκτυο Ουλαμού – Δίκτυο Επιλαρχίας","Δίκτυο Ουλαμού – Δίκτυο Ίλης – Δίκτυο Μοίρας ΠΒ","Δίκτυο Ίλης – Δίκτυο Αξκου Συνδέσμου (ΚΣΠΥ) – Δίκτυο της Πυροβολαρχίας του"},
            {"Από τον Δκτή της ίλης", "Από τον ΠΑΠ και τους ουλαμαγούς", "Από τον Δκτη της Ίλης και τον ΠΑΠ"},
            {"Μετωπικά – Διασταυρούμενα – Πυρά σε βάθος", "Ταυτόχρονα – Εναλλασσόμενα – Παρατηρούμενα ", "Πλευρικά – Ταυτόχρονα – Διακεκομμένα "},
            {"Ταυτόχρονα πυρά – Εναλλασσόμενα πυρά – Παρατηρούμενα πυρά", "Ταυτόχρονα πυρά – Εναλλασσόμενα πυρά – Διακεκομμένα πυρά", "Διακεκομμένα πυρά – Άμεσα πυρά – Έμμεσα πυρά"},
            {"Εναλλασσόµενα, διαδοχικά και καλυπτόµενα", "Συνεχόμενα και διεισδύοντα", "Τίποτε από τα παραπάνω",},
            {"Βέλους, V, φάλαγγας, Κλιμακηδόν και Παρατάξεως", "Βέλους, τρίγωνο με τη βάση πίσω, φάλαγγας, Κλιμακηδόν και Παρατάξεως", "Βέλους, V, φάλαγγας, Κλιμακηδόν αριστερά και δεξιά και κύκλου"},
            {"Παρέχει ικανοποιητική ισχύ πυρός προς τα εµπρός και προς τις πλευρές", "Παρέχει ευκαµψία, γιατί τα ακολουθούντα τµήµατα µπορούν να ελιχθούν µέσα και γύρω από τα επικεφαλής στοιχεία, για να διατηρήσουν την ορµητικότητα και το ρυθµό της προέλασης", "Τίποτε από τα παραπάνω"},
            {"Είναι δύσκολος στον έλεγχο", "Επιτρέπει την διατήρηση συνεχούς και σταθερής προσπάθειας", "Τα α και β"},
            {"Περιγραφή του στόχου", "Προειδοποίηση", "Αναφορά απωλειών"},
            {"Να το παραβιάσει", "Να το παρακάµψει", "Να το διασπάσει"},
            {"Περιγραφή του στόχου", "Προειδοποίηση και Κατευθηνση", "Όλα τα παραπάνω"},
            {"Τα πυρά των ΤΟΜΠ", "Τα πυρά των αρμάτων", "Τα πυρά πυροβολικού και όλµων"},
            {"Έδαφος και θέση εχθρού", "Το νέο σχηματισμό και την αντίστοιχη θέση του κάθε άρματος σ’αυτόν", "Το νέο σχηματισμό και τη θέση του"},
            {"Καταστροφή του εχθρού", "Λήψη επαφής με τον εχθρό", "Καταδίωξη του εχθρού"},
            {"Έχουμε οπτική επαφή και δεχόμαστε άµεσα πυρά", "Δεχόμαστε έµµεσα πυρά", "Όλα τα παραπάνω"},
            {"Η θέση του ουλαμού και το δρομολόγιό του", "Ο εχθρός και η τρωτότητα του ουλαμού", "Όλα τα παραπάνω"},
            {"Αναδιοργάνωση", "Σταθεροποίηση", "Αντεπίθεση εκτός τοποθεσίας"},
            {"Συνεχής και λεπτομερής παρατήρηση του πεδίου της μάχης", "Ευελιξία και Συγκέντρωση υπέρτερης μαχητικής ισχύος", "Οργάνωση συνεχούς κινητής υποστήριξης"},
            {"Προέλαση, επίθεση (εσπευσμένη ή προπαρασκευασμένη), απαγκίστρωση", "Προέλαση, επίθεση (εσπευσμένη ή προπαρασκευασμένη)", "Προέλαση, επίθεση (εσπευσμένη ή προπαρασκευασμένη), κατακόρυφη υπερκέραση"}
    };

    private String mCorrectAnswers[] = {"Την αυτόματη αντίδραση σε καταστάσεις μάχης",
            "Δίκτυο Ίλης – Δίκτυο Αξκου Συνδέσμου (ΚΣΠΥ) – Δίκτυο της Πυροβολαρχίας του",
            "Από τον Δκτη της Ίλης και τον ΠΑΠ",
            "Μετωπικά – Διασταυρούμενα – Πυρά σε βάθος",
            "Ταυτόχρονα πυρά – Εναλλασσόμενα πυρά – Παρατηρούμενα πυρά",
            "Τίποτε από τα παραπάνω",
            "Βέλους, V, φάλαγγας, Κλιμακηδόν και Παρατάξεως",
            "Τίποτε από τα παραπάνω",
            "Τα α και β",
            "Αναφορά απωλειών",
            "Να το παρακάµψει",
            "Όλα τα παραπάνω",
            "Τα πυρά πυροβολικού και όλµων",
            "Το νέο σχηματισμό και την αντίστοιχη θέση του κάθε άρματος σ’αυτόν",
            "Λήψη επαφής με τον εχθρό",
            "Όλα τα παραπάνω",
            "Τα α και β",
            "Σταθεροποίηση",
            "Οργάνωση συνεχούς κινητής υποστήριξης",
            "Προέλαση, επίθεση (εσπευσμένη ή προπαρασκευασμένη))"};

    public String getQuestion(int a){
        String question = mQuestions[a];
        return question;
    }

    public String getChoice1(int a){
        String choice0 = mChoices[a][0];
        return choice0;
    }

    public String getChoice2(int a){
        String choice1 = mChoices[a][1];
        return choice1;
    }

    public String getChoice3(int a){
        String choice2 = mChoices[a][2];
        return choice2;
    }

    public String getCorrectAnswer(int a){
        String answer = mCorrectAnswers[a];
        return answer;
    }

    public int getLength(){
        int totalQuestions = mCorrectAnswers.length;
        return totalQuestions;
    }
}
